Revit 2026 API

# NurbSplineSetControlPointsAndWeights Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetControlPointsAndWeights(
	IList<XYZ> ctrlPoints,
	DoubleArray weights
)
```
```vb
Public Sub SetControlPointsAndWeights (
	ctrlPoints As IList(Of XYZ),
	weights As DoubleArray
)
```
```cpp
public:
void SetControlPointsAndWeights(
	IList<XYZ^>^ ctrlPoints,
	DoubleArray^ weights
)
```
```fsharp
member SetControlPointsAndWeights :
        ctrlPoints : IList<XYZ> *
        weights : DoubleArray -> unit
```

#### Parameters

ctrlPoints IListXYZ

weights DoubleArray

#### Reference

NurbSpline Class

Autodesk.Revit.DB Namespace